import random
import time


RED = "\033[91m"
GREEN = "\033[92m"
YELLOW = "\033[93m"
CYAN = "\033[96m"
MAGENTA = "\033[95m"
RESET = "\033[0m"  #


print(CYAN + r"""
████████╗ █████╗ ██████╗ ███████╗████████╗
╚══██╔══╝██╔══██╗██╔══██╗██╔════╝╚══██╔══╝
   ██║   ███████║██████╔╝█████╗     ██║
   ██║   ██╔══██║██╔══██╗██╔══╝     ██║
   ██║   ██║  ██║██║  ██║███████╗   ██║
   ╚═╝   ╚═╝  ╚═╝╚═╝  ╚═╝╚══════╝   ╚═╝

გინდა თამაშის დაწყება?
ჩაწერე: კი / არა
""" + RESET)

start_game = input("➤ ").strip()

if start_game != "კი":
    print(MAGENTA + r"""
==============================
👋 თამაში დასრულდა
მადლობა რომ ეწვიე!
==============================
""" + RESET)
    exit()


print(YELLOW + """
აირჩიე სირთულე:
1️⃣ Level 1  (1 - 100)
2️⃣ Level 2  (1 - 200)
3️⃣ Level 3  (1 - 300)
""" + RESET)

choose_level = int(input("შენი არჩევანი (1/2/3): ").strip())

if choose_level == 1:
    max_number = 100
elif choose_level == 2:
    max_number = 200
elif choose_level == 3:
    max_number = 300
else:
    print(RED + "❌ არასწორი დონე" + RESET)
    exit()


number = random.randint(1, max_number)
start_time = time.time()

print(GREEN + "\n🔢 თამაში დაიწყო! წარმატებები!\n" + RESET)


while True:
    guess_input = input(f"გამოიცანი რიცხვი 1-დან {max_number}-მდე: ").strip()

    if not guess_input.isdigit():
        print(RED + "❌ გთხოვ, ჩაწერე მთელი რიცხვი!" + RESET)
        continue

    guess_number = int(guess_input)

    if guess_number > number:
        print(RED + "⬆️ მაღალია\n" + RESET)
    elif guess_number < number:
        print(YELLOW + "⬇️ დაბალია\n" + RESET)
    else:
        print(GREEN + r"""
██╗   ██╗██╗███╗   ██╗
██║   ██║██║████╗  ██║
██║   ██║██║██╔██╗ ██║
╚██╗ ██╔╝██║██║╚██╗██║
 ╚████╔╝ ██║██║ ╚████║
  ╚═══╝  ╚═╝╚═╝  ╚═══╝

🎉 საღოლ! გამოიცანი! 🎉
""" + RESET)
        break


end_time = time.time()
total_time = round(end_time - start_time, 2)

print(MAGENTA + r"""
███████╗███╗   ██╗██████╗ 
██╔════╝████╗  ██║██╔══██╗
█████╗  ██╔██╗ ██║██║  ██║
██╔══╝  ██║╚██╗██║██║  ██║
███████╗██║ ╚████║██████╔╝
╚══════╝╚═╝  ╚═══╝╚═════╝

🎉 თამაში დასრულდა 🎉
""" + RESET)

print(CYAN + f"⏱️ შენ დახარჯე {total_time} წამი" + RESET)
print(GREEN + "👏 კარგად ითამაშე! მადლობა ❤️" + RESET)